cases/00-tutorials/hartmann1d-fine/0/magperm
/*--------------------------------*- C++ -*----------------------------------*\
  =========
  \\      /  F ield           OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration       Website:  www.openfoam.com
    \\  /    A nd             Version:  v2506
     \\/     M anipulation
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      magperm;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../constant/propertiesReference"
dimensions      [1 1 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           uniform $magnetic_permeability_air_;
    }

    outlet
    {
        type            fixedValue;
        value           uniform $magnetic_permeability_air_;
    }

    lowerWall
    {
        type            fixedValue;
        value           uniform $magnetic_permeability_air_;
    }

    upperWall
    {
        type            fixedValue;
        value           uniform $magnetic_permeability_air_;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
