cases/00-tutorials/hartmann1d-fine/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                  
  \\      /  F ield           OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration       Website:  www.openfoam.com
    \\  /    A nd             Version:  v2506
     \\/     M anipulation   
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    lowerWall
    {
        type            calculated;
        value           $internalField;
    }

    upperWall
    {
        type            calculated;
        value           $internalField;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
