cases/00-tutorials/hartmann1d-fine/0/pH
/*--------------------------------*- C++ -*----------------------------------*\
  =========                                                                    
  \\      /  F ield           OpenFOAM: The Open Source CFD Toolbox            
   \\    /   O peration       v2506                                  
    \\  /    A nd             Web:      www.OpenFOAM.org                       
     \\/     M anipulation                                                     
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pH;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [2 2 -5 0 0 0 0];//[1 1 -3 0 0 0 0];// <- original units//[2 2 -5 0 0 0 0];//

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    lowerWall
    {
        type            zeroGradient;  
    }

    upperWall
    {
	    type            zeroGradient;
    }
    
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
