cases/00-tutorials/hartmann1d-fine/constant/propertiesReference
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      propertiesReference;
}
/*
    Reference file for sharing key parameters
*/

magnetic_permeability_air_ 1;
elec_conductivity_air_     1000; // Directly impacts Ha number.