cases/00-tutorials/hartmann1d-fine/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

xmin_value      0;

xmax_value      1;

ymin_value      -0.5;

ymax_value      0.5;

scale           1;

dx              0.005;

xmin            0;

xmax            1;

ymin            -0.5;

ymax            0.5;

zmin            0;

zmax            0.1;

ny              100;

vertices        ( ( 0 -0.5 0 ) ( 1 -0.5 0 ) ( 1 0.5 0 ) ( 0 0.5 0 ) ( 0 -0.5 0.1 ) ( 1 -0.5 0.1 ) ( 1 0.5 0.1 ) ( 0 0.5 0.1 ) );

blocks          ( hex ( 0 1 2 3 4 5 6 7 ) ( 1 100 1 ) simpleGrading ( 1 1 1 ) );

boundary        ( inlet { type patch ; faces ( ( 0 4 7 3 ) ) ; } outlet { type patch ; faces ( ( 2 6 5 1 ) ) ; } lowerWall { type patch ; faces ( ( 0 1 5 4 ) ) ; } upperWall { type patch ; faces ( ( 2 3 7 6 ) ) ; } back { type empty ; faces ( ( 0 3 2 1 ) ) ; } front { type empty ; faces ( ( 4 5 6 7 ) ) ; } );


// ************************************************************************* //
